#!/bin/bash

system_is() {
  test=$(uname -a 2>/dev/null | grep -i $1)
  if [ -z "$test" ]; then
    return 1
  else
    return 0
  fi
}

####################################################################
# 清理
####################################################################
echo "*************** 清理 ****************"
# 因每次在Cygwin环境下关闭程序时未能关闭Windows程序，
# 且由于go run有可能忽略已更新的内容（tmp目录），导致程序失败
# 故执行此文件清理上一次测试的残留内容
if system_is cygwin; then
  rm ./run_test/* -rf
else
  echo "暂时仅用于Cygwin环境下的清理"
fi

####################################################################
# 编译运行
####################################################################
echo "*************** 编译运行 ************"
go build -o ./run_test/littleWebServer.exe && ./run_test/littleWebServer.exe
